OpenDTEF-v1812/etc/templates/compressibleInflowOutflow/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          500;
Tout            298;    // Used for fixedValue boundary condition on walls

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $Tout;
        value           $inletValue;
    }

    wall
    {
        type            fixedValue;
        value           uniform $Tout;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
